:PROPERTIES:
:header-args:racket: :lang racket
:header-args: :eval no :exports code
:END:

#+TITLE: Racket for the Masses

*** Math looks like functions
:PROPERTIES:
:header-args: :eval try :exports both
:END:
Math has no special representation nor it changes the way the code is normally evaluated.

So, this in most languages:

#+begin_src ruby
1 + 2 + 3 * 4 * 5
#+end_src

#+RESULTS:
: 63

Is written in Racket like this:

#+begin_src racket
(+ 1 2 (* 3 4 5))
#+end_src

#+RESULTS:
: 63

Probably you've noticed that mathematical functions accepts multiple arguments, not just two as a traditional mathematical operator. So, this is a sum:

#+begin_src racket
(+ 1 2 3 4 5 6)
#+end_src

#+RESULTS:
: 21

That also is true for boolean and comparison functions.

Think of this one as "arguments are in crescent order":
#+begin_src racket
(< 0 2 8 10)
#+end_src

#+RESULTS:
: #t

And this one is "all the conditions are true":
#+begin_src racket
(and (< 1 2) (<= 3 3 4 5) (= 1 1 1))
#+end_src
*** Function definitions also look like function calls
Any other language have well defined syntaxes and reserved keywords for defining functions, methods, classes and so on.

For example, a function in Python is defined like this:

#+begin_src python :results pp :session
def add1(a):
    return a + 1

add1(10)
#+end_src

#+RESULTS:
: 11

In Racket, defining a function looks like we are just /calling/ the function ~define~:

#+begin_src racket :lang racket
(define (add1 a) (+ a 1))
(add1 10)
#+end_src

#+RESULTS:
: 11

*** Anonymous functions look like functions
:PROPERTIES:
:header-args: :exports both
:END:

Anonymous functions or code block in other languages also have special syntaxes. For example, a code block in Ruby looks like this:

#+begin_src ruby
add1 = -> a { a + 1 }
add1[10]
#+end_src

#+RESULTS:
: 11

In Racket they still look like functions:

#+begin_src racket :lang racket :results silent
(define add1 (lambda (a) (+ a 1)))
(add1 10)
#+end_src

Or using the character "λ" instead of the word "lambda".

#+begin_src racket :lang racket
(define add1 (λ (a) (+ a 1)))
(add1 10)
#+end_src

#+RESULTS:
: 11

However, for simple functions like that, it is common to just use currying.

#+begin_src racket :lang racket
(define add1 (curry + 1))
(add1 10)
#+end_src

#+RESULTS:
: 11

